# Это комментарий. Многострочного комментария в языке нет
# Вот вторая строка

"""
Строка документации. Используется для документирвоание того или иного
участка кода
"""

"""
Std IO - Standart Input/Output
Стандартный ввод-вывод.
Задача: понять, как выводить данные из программы (вывод в консоль)
и как поулчать данные в программу(ввод из консоли\считывание из консоли)
"""

# Простейший вывод в выходной поток
# print() - команда для вывода на консоль
print("Hello world!") # когда print() отрабатывает - происходит перенос на новую строку
print("Привет, мир!")

# Вывод информации из переменной
message = "Hello from message"
print(message)

# Вывод нескольких значений
first_word = "Первый"
second_word = "Второй"
third_word = "Третий"

print(first_word, second_word, third_word) # при перечислении в выводе 
                                           # значения будут разделены одним пробельным символом " "
