"""
СЕКРЕТНАЯ ГЛАВА
"""
#print(1,2,2,2,2,2,2,2,2,2,2,2,2,22,2,2,2,22,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,22,2,2,2, sep="#", end="\n")
"""
Выход - используем континуальные аргументы
"""
def mult(*args:int):
    """
    *args - конвертирует все входные параметры в кортеж args
    """
    print("This args:", args)
    result = 1
    for elem in args:
        result *= elem
    print("Mult result:", result)
    

mult(1)
mult(1,2)
mult(1,2,3,4,5,5,6)
mult(2,2,2,2,2,2,2,2,2,22,2,2,2,22,2,2,2,2,2,2,2,22,2,2,22,2,2,2)
mult()
